:PROPERTIES:
:ID:       8d000651-cfc6-41ff-910c-c3c8467085a2
:END:
#+title: Lua

** First

#+BEGIN_SRC lua :results output
local function hello(name)
	print("hello", name)
end

hello("world ")
#+END_SRC

#+RESULTS:
: hello	world

